import BackButton from '../components/BackToMainButton';
import './InfoPages.css';

const FAQ_Page = () => {
    const questions = [
        { q: "Що таке HUM ENGINE?", a: "Це платформа для любителів мототехніки, де ви можете переглядати характеристики, порівнювати моделі та знаходити найкращі пропозиції від магазинів-партнерів з використанням зручних фільтрів." },
        {q:"Як додати товар у Кошик або Обране?", a:"Натисність на картку товару для переходу на його сторінку, де ви знайдете кнопки 'Додати до кошика' та 'Додати до обраного'. Після додавання перегляд списку кошика та обраного доступний у вкладці Профіль."},
        {q:"Як переглянути список доступних товарів конкретного магазину?", a:"Скористайтесь вкладкою 'Магазини' для перегляду всіх партнерських магазинів. Виберіть цікавий магазин, щоб побачити його профіль з усіма доступними товарами та їх характеристиками. Або перейдіть до магазину через мініпрофіль у товарі."},
        // {q:"", a:""},
        { q: "Як додати свій товар?", a: "Перейдіть у розділ 'Партнерство' та зареєструйте свій магазин, якщо цього ще не зробили. Після модерації ви зможете додавати товари через панель керування." },
        { q: "Що за 'Гра' у меню?", a: "Це вбудована міні-гра (Sticks), щоб ви могли розслабитися між пошуком ідеального двигуна." },
        { q: "Чи є доставка?", a: "Умови доставки залежать від конкретного магазину-продавця. Деталі можна знайти в профілі магазину. Однак на даний момент будь-який спосіб доставки - не реалізований на сайті." }
    ];

    return (
        <div className="info-page-container">
            <h1 className="page-title">FAQ</h1>
            <div className="faq-list">
                {questions.map((item, i) => (
                    <div key={i} className="faq-card">
                        <h3 className="faq-question"><span>?</span> {item.q}</h3>
                        <p className="faq-answer">{item.a}</p>
                    </div>
                ))}
            </div>
            <BackButton />
        </div>
    );
};

export default FAQ_Page;